<h1><center>Experiment 6</center></h1>
<h2><center>Experiment on Nested Queries</center></h2>

In [3]:
import sqlite3

In [4]:
import pandas as pd

In [5]:
# creating and connecting to that database
conn=sqlite3.connect('exp6.db')

In [6]:
# preparing a cur object 
cur = conn.cursor()

In [7]:
query = """
    CREATE TABLE IF NOT EXISTS emp(
        e_id INT(10) PRIMARY KEY, 
        e_name TEXT NOT NULL,
        dept TEXT NOT NULL,
        salary INTEGER(10)
    )
"""
cur.execute(query)

In [8]:
pd.read_sql("select * from emp;",conn)

   e_id e_name  dept  salary
0     1    Ram    HR   10000
1     2  Amrit  MRKT   20000
2     3   Ravi    HR   30000
3     4  Nitin  MRKT   40000
4     5  Varun    IT   50000

In [11]:
query = """
    INSERT INTO emp VALUES
        (1,'Ram','HR',10000),
        (2,'Amrit','MRKT',20000),
        (3,'Ravi','HR',30000),
        (4,'Nitin','MRKT',40000),
        (5,'Varun','IT',50000)
"""
cur.execute(query)

In [12]:
conn.commit()

In [9]:
pd.read_sql("SELECT * FROM emp",conn)

   e_id e_name  dept  salary
0     1    Ram    HR   10000
1     2  Amrit  MRKT   20000
2     3   Ravi    HR   30000
3     4  Nitin  MRKT   40000
4     5  Varun    IT   50000

#### To Display employee name who is taking maximum salary

In [10]:
query=("select e_name from emp where salary = (select max(salary) from emp)")
pd.read_sql(query,conn)

  e_name
0  Varun

#### To Display second highest salary from emp table

In [11]:
query=("select max(salary) from emp where salary <> (select max(salary) from emp)")
pd.read_sql(query,conn)

   max(salary)
0        40000

#### To Display employee name who is taking second highest salary

In [12]:
query=("select e_name from emp where salary = (select max(salary) from emp where salary <> (select max(salary) from emp))")
pd.read_sql(query,conn)

  e_name
0  Nitin

#### To Display all the emp names  where no. of employees in a department are less than 2

In [13]:
query=("select e_name from emp where dept in (select dept from emp group by dept having count(*) < 2);")
pd.read_sql(query,conn)

  e_name
0  Varun

#### To Display highest salary department wise and name of emp who is taking that salary

In [25]:
query=("select e_name,dept,salary from emp where salary in (select max(salary) from emp group by dept);")
pd.read_sql(query,conn)

  e_name  dept  salary
0   Ravi    HR   30000
1  Nitin  MRKT   40000
2  Varun    IT   50000